import MaxWidthWrapper from "@/components/MaxWidthWrapper";
import React from "react";

type Props = {};

const PrivacyPage = (props: Props) => {
  return (
    <main>
      <section>
        <MaxWidthWrapper>
          <div>
            <h1> Політика конфіденційності</h1>
            <article>
              <p>Останнє оновлення: 2024.04.10</p>
              <p>
                Ваша конфіденційність дуже важлива для нас. У цій політиці
                конфіденційності ми пояснюємо, яку інформацію ми збираємо, як ми
                використовуємо її і як ви можете звертатися до нас щодо
                управління своєю інформацією.
              </p>
            </article>
            <article>
              <h2>Збір та використання інформації</h2>
              <p>
                Ми можемо збирати різні типи інформації з метою забезпечення та
                покращення наших послуг.
              </p>
            </article>
            <article>
              <h2>Збереження даних</h2>
              <p>
                Ми зберігаємо ваші персональні дані лише стільки, скільки це
                необхідно для забезпечення вам наших послуг та відповідно до
                законодавства, яким підлягаємо.
              </p>
            </article>
            <article>
              <h2>Куки</h2>
              <p>
                Ми використовуємо куки та аналогічні технології для збору
                інформації та поліпшення нашого обслуговування.
              </p>
            </article>
            <article>
              <h2>Ваші права</h2>
              <p>
                Ви маєте право вимагати видалення вашої особистої інформації з
                наших систем.
              </p>
            </article>
            <article>
              <h2>Зміни до цієї політики конфіденційності</h2>
              <p>
                Ми можемо час від часу оновлювати нашу політику
                конфіденційності. Ми повідомимо вас про будь-які зміни,
                розмістивши нову політику конфіденційності на цій сторінці.
              </p>
            </article>
            <article>
              <h2> Зв&apos;яжіться з нами</h2>
              Якщо у вас є питання щодо цієї політики конфіденційності,
              зв&apos;яжіться з нами:
              <br />
              Через
              <span>
                <a href="https://discord.gg/vC2jtXVm">TeamForce</a>
              </span>
            </article>
            <p></p>
          </div>
        </MaxWidthWrapper>
      </section>
    </main>
  );
};

export default PrivacyPage;
