import MaxWidthWrapper from "@/components/MaxWidthWrapper";
import React from "react";

type Props = {};

const TermsPage = (props: Props) => {
  return (
    <main>
      <section>
        <MaxWidthWrapper>
          <div className="flex flex-col items-center pb-10">
            <h1 className="text-[32px]  text-[#FDD901] font-normal leading-10 mb-8">
              Политика использования
            </h1>
            <div className="flex flex-col gap-8">
              <article className="flex flex-col gap-4">
                <h2 className="text-[26px] font-normal leading-10">
                  Приветствуем вас на сайте интернет ресурса &quot;4,6 Mafia
                  Клуб&quot;
                </h2>
                <p>
                  Дорогой Посетитель, администрация информационного ресурса
                  &quot;4,6 Mafia Club Budapest&quot; благодарит вас за
                  посещение нашего сайта &quot;4,6 Mafia Club Budapest&quot;
                  <br />
                  Пожалуйста, ознакомьтесь с Правилами и условиями использования
                  сайта &quot;4,6 Mafia Club Budapest&quot; перед тем, как
                  начать пользоваться сайтом &quot;4,6 Mafia Club Budapest&quot;
                </p>
              </article>
              <article>
                <h2 className="text-[26px] font-normal leading-10">
                  I. Правила и условия использования сайта &quot;4,6 Mafia Club
                  Budapest&quot;
                </h2>
                <p>
                  1.1. Эти Условия и правила использования ресурса &quot;4,6
                  Mafia Club Budapest&quot; (далее Сайт) разработаны
                  администрацией сайта (далее Администрация) и устанавливают
                  условия использования сайта и устанавливают условия
                  использования и развития Сайта, а также права и обязаности его
                  Пользователей и Администрации.
                  <br />
                  1.2. Эти условия и Правила (далее Правила) есть обязательным
                  договором между Пользователем и Сайтом. Правила есть
                  юридическим договором между Пользователем и Администрацией,
                  предметом которого есть предоставление Администрацией
                  Пользователю услуг с использования Сайта, которые регулируют
                  доступ и испльзование Сайта, который надаються Сайтом на
                  следующих условиях:
                  <br />
                  1.2.1. Доступ Пользователя к данному веб-сайту и его
                  использование подчиняется настоящим Правилам. Получив доступ к
                  Сайту и используя его Пользователь принимает без ограничений и
                  оговорки, юридически обязательное соблюдение Правил, которые
                  вступают в силу сразу после первого посещения Пользователем
                  сайта «4,6 Mafia Club Будапешт».
                  <br />
                  Если Пользователь не согласен соблюдать настоящие Правила,
                  Пользователь имеет право больше не посещать и/или не
                  использовать Сайт.
                  <br />
                  1.2.2 Администрация оставляет за собой право изменять и/или
                  дополнить настоящие условия в одностороннем порядке в любое
                  время без любого специального уведомления путем публикации
                  изменений на веб-сайте.
                  <br />
                  Настоящие Правила являются открытым и общедоступным
                  документом. действующая версия Правил размещена в сети
                  Интернет.
                  <br />
                  Администрация настоятельно рекомендует регулярно перечитывать
                  настоящие Правила, чтобы быть в курсе всех внесенных изменений
                  Администрацией «4,6 Mafia Club Будапешт». Если Пользователь
                  продолжает использовать веб-сайт «4,6 Mafia Club Будапешт»
                  после публикации изменений в разделе Правила, последние
                  автоматически принимает на себя юридическое обязательство
                  соблюдать эти Правила со всеми изменениями и/или
                  изменениями/дополнениями, внесенными в их.
                  <br />
                  1.2.3. Незнание правил не освобождает вас от ответственности,
                  необходимо следовать им. Размещение любого сообщения на сайте
                  Пользователеем автоматически означает свое согласие с
                  настоящими правилами и необходимость их соблюдения.
                </p>
              </article>
              <article>
                <h2 className="text-[26px] font-normal leading-10">
                  II. Авторские права и право собственности на контент
                </h2>
                <p>
                  2.1. Данный Сайт и все Содержание сайта, материалы
                  опубликованные на сайте (далее – «Контент») охраняются
                  законодательством Украины, а также международным
                  законодательством об авторском праве и связанных с ним правах.
                  <br />
                  2.1.1 Права интеллектуальной собственности на Контент: тексты,
                  дизайны, логотипы, графика, иконки, изображения и другие
                  материалы по данному вопросу Сайта является собственностью
                  «4,6 Mafia Club Будапешт» или содержащиеся на Сайте с
                  разрешения соответствующего владелеца.
                  <br />
                  2.1.2. Создание ссылок на Сайт поощряется в соответствии с
                  следующие условия:
                  <br />
                  1) Пользователь заранее сообщит Администрации о каждой ссылке
                  в письменном виде;
                  <br />
                  2) Ссылка не будет содержать или подразумевать какие-либо
                  указания на то, что «4,6 «Мафия Клуб Будапешт» спонсирует
                  и/или поддерживает сайт Пользователя.
                  <br />
                  3) Пользователь немедленно удалит любые ссылки на Сайт, по
                  первому требованию Администрации.
                  <br />
                  2.2. Использование Пользователем любого Контента (копирование,
                  публикация, и т.д.) без письменного разрешения Администрации
                  и/или владелеца Контента строго запрещенный. Администрация
                  будет обеспечивать соблюдение своих права интеллектуальной
                  собственности в максимально разрешенной степени по закону,
                  включая уголовное преследование.
                </p>
              </article>
              <article>
                <h2 className="text-[26px] font-normal leading-10">
                  III. Содержание и работа сайта
                </h2>
                <p>
                  3.1. Администрация прилагает все разумные усилия для
                  обеспечения достоверности информации на Сайте.
                  <br />
                  3.2. Администрация не предоставляет гарантий относительно
                  достоверность информации, ее своевременность, достоверность и
                  безопасность.
                  <br />
                  3.3. Содержимое Сайта может содержать неточности и опечатки.
                  <br />
                  3.4. Администрация оставляет за собой право без
                  предупреждения, изменять или удалять любую часть информации,
                  размещенной на Сайте в любое время.
                  <br />
                  3.5. Администрация имеет право приостановить или прекратить
                  работу данного Сайта по своему усмотрению
                  <br />
                  3.6. Администрация не несет ответственности за любые потери
                  или ущерб, причиненный:
                  <br />
                  3.6.1 Использованием данного сайта или невозможностью его
                  использования.
                  <br />
                  3.6.2. Вызвано изменением или удалением информации, а также
                  остановка или прекращение работы сайта
                  <br />
                  3.7. Администрация не несет ответственности за любые убытки
                  возникшие из-за неточностей в графике.
                </p>
              </article>
              <article>
                <h2 className="text-[26px] font-normal leading-10">
                  IV. Использование сайта
                </h2>
                <p>
                  5.1. Любой посетитель сайта «4,6 Mafia Club Будапешт» может
                  стать пользователем Сайта, который получит возможность
                  использовать интерактивные сервисы и сервисы, предоставляемые
                  Сайтом которые не требуют регистрации.
                  <br />
                  5.2. Пользователь Сайта может зарегистрироваться, чтобы
                  пользоваться всеми спектрами услуг и интерактивных услуг,
                  которые требуют регистрацию и сможете:
                  <br />
                  5.2.1. Каждый раз, когда вы посещаете наш сайт, Пользователь
                  авторизуется под присвоенным пользователю ником, без
                  повторного входа пароль.
                  <br />
                  5.2.2. Пользователь сможет получать ответы по электронной
                  почте на адрес сообщения, оставленные на сайте, а также на
                  которые он подписался;
                  <br />
                  5.2.3. Пользователь сможет оценить:
                  <br />
                  1) Посмотреть все записаные игры, при условии использования
                  даного сайта;
                  <br />
                  2) Посмотреть информацию о других участниках
                  <br />
                  4) Следить за графиком проведения игр
                  <br />
                  5) Участвовать в соревнованиях;
                  <br />
                  6) сможет получить статус редактора и вместе с Администрацией
                  и редакцией сайта, участвовать в работе сайта: оставлять свои
                  отзывы, мультимедийные файлы, фотографии и т. д.
                  <br />
                  5.2.4. Размещая комментарии на Сайте, Пользователь обязан
                  соблюдать соответствующиме правила: Не публикуйте сообщения,
                  содержащие:
                  <br />
                  1) Призывы к нарушению действующего законодательства,
                  высказывания расистский характер, разжигание межнациональной
                  розни и что-либо еще что подпадает под действие Уголовного
                  кодекса Украины;
                  <br />
                  2) Заведомо ложная информация;
                  <br />
                  3) Явная реклама;
                  <br />
                  4) Грубые, нецензурные выражения и оскорбления в любой форме.
                  - сообщения грубого тона, содержащие «нападки» на физические
                  лица;
                  <br />
                  5) Не имеет отношения к обсуждаемой теме.
                  <br />
                  5.2.5. Если вы согласны с чужим отзывом, просто проголосуйте
                  за это поставив «+1» <br />
                  5.3. Администрация оставляет за собой право: (
                  <br />
                  1) удалять сообщения, содержащие только цитату из чужого
                  отзыва;
                  <br />
                  2) удалять и редактировать сообщения.
                  <br />
                  5.4. Администрация не несет никакой ответственности за
                  сообщения, размещенные Пользователем на Сайте, поскольку все
                  сообщения отражают мнение их авторов. <br />
                  5.3. Администрация оставляет за собой право в одностороннем
                  порядке по своему усмотрению лишить Пользователя регистрации,
                  если Пользователь нарушает настоящие Правила без
                  предварительного уведомления нарушителя.
                </p>
              </article>
            </div>
          </div>
        </MaxWidthWrapper>
      </section>
    </main>
  );
};

export default TermsPage;
